{
  "1. Write the scope and importance of Environmental Study.": {
    "answer": "\nScope:\nEnvironmental studies is a multidisciplinary field that covers aspects of biology, geology, chemistry, physics, engineering, sociology, health, anthropology, economics, statistics, computers, and philosophy. It deals with every issue that affects an organism and seeks practical answers to making human civilization sustainable on the earth’s finite resources. It also encompasses the study of natural landscapes and the impact of human activities on them, as well as the interdependence of our daily lives with the environment.\n\nImportance:\nThe importance of environmental studies cannot be overstated. It is vital for the future of mankind, as the degradation of our environment is linked to continuing problems of pollution, loss of forests, solid waste disposal, economic productivity, national and ecological security. It is also crucial for preventing disasters and managing environmental hazards. Additionally, with the increasing levels of global warming, depletion of the ozone layer, and loss of biodiversity, it is critical for every citizen of the earth to have a clear understanding of environmental concerns and adopt sustainable development practices. Furthermore, India, being a biodiverse country, must prioritize environmental conservation to protect its rich biodiversity and resources.",
    "pages": [
      30,
      32,
      16,
      34
    ]
  },
  "2. Discuss vertical structure of atmosphere and significance of each layer with suitable diagram.": {
    "answer": "\nThe atmosphere is divided into several layers, each with its own unique characteristics and relevance to environmental problems. The vertical structure of the atmosphere is shown in the diagram below:\n\n1. Troposphere:\n- This is the innermost layer of the atmosphere, extending 17 kilometers above sea level at the equator and 8 kilometers over the poles.\n- It contains about 75% of the mass of the earth's air and is where most of our weather occurs.\n- Temperature declines with altitude in this layer.\n- The tropopause, where temperature reversal occurs, marks the end of the troposphere and the beginning of the stratosphere.\n\n2. Stratosphere:\n- This is the second layer of the atmosphere, extending from 17 to 48 kilometers above the earth's surface.\n- The composition of the stratosphere is similar to that of the troposphere, but with two major differences.\n- The volume of water vapour here is about 1000 times less, while the volume of ozone is about 1000 times greater.\n- The presence of ozone in the stratosphere prevents about 99% of the sun's harmful ultraviolet radiation from reaching the earth's surface, protecting humans from cancer and damage to the immune system.\n- Temperature rises with",
    "pages": [
      140,
      191,
      86,
      142
    ]
  },
  "3. Write the structure (components) and function of ecosystem.": {
    "answer": "Structure (Components):\n    1) Inorganic aspects - C, N, CO2, H2O\n    2) Organic compounds - Protein, Carbohydrates, Lipids\n    3) Climatic regimes - Temperature, Moisture, Light, Topography\n    4) Producers - Plants\n    5) Macro consumers - Phagotrophs (Large animals)\n    6) Micro consumers - Saprotrophs, Absorbers (Fungi)\n\n    Function:\n    1) Energy cycles\n    2) Food chains\n    3) Diversity - interlinkages between organisms\n    4) Nutrient cycles - biogeochemical cycles\n    5) Evolution",
    "pages": [
      5,
      80,
      81,
      83
    ]
  },
  "4. Differentiate the food chain and food web. Write the types of food chain with example.": {
    "answer": "\nFood chains are linear relationships between organisms in which energy is transferred from one organism to another. It shows the flow of energy from producers to consumers and decomposers. It is a simple representation of the feeding relationships in an ecosystem.\n\nOn the other hand, food webs are interconnected food chains that show the complex feeding relationships in an ecosystem. It takes into account the multiple ways that energy is transferred between organisms. It shows the interdependence of species in an ecosystem.\n\nTypes of food chains include:\n\n1. Grazing food chain: This type of food chain starts with green plants as producers, then herbivores as primary consumers, and finally carnivores as secondary and tertiary consumers. Example: Grass → Deer → Wolf.\n\n2. Detritus food chain: This type of food chain starts with dead organic matter as producers, then detritivores (decomposers) as primary consumers, and finally carnivores as secondary and tertiary consumers. Example: Dead leaves → Earthworm → Bird.\n\n3. Parasitic food chain: This type of food chain starts with a parasite as producer, then the host as primary consumer, and finally predators as secondary and tertiary consumers. Example: Flea → Dog → Wolf.\n\n4. Saprophytic food chain: This type of food",
    "pages": [
      349,
      90,
      351,
      347
    ]
  },
  "5. Define biogeocycle and discuss nitrogen cycle with suitable schematic diagram.": {
    "answer": "Biogeocycle refers to the interconnected cycles of matter and energy that take place in our biosphere, specifically the carbon, oxygen, nitrogen, and water cycles. These cycles are essential for maintaining life on Earth and are closely linked to each other. One of the most important biogeocycles is the nitrogen cycle, which is responsible for converting nitrogen gas from the atmosphere into a form that can be used by living organisms.\n\nThe nitrogen cycle starts with nitrogen gas in the atmosphere (N2), which is converted into ammonia (NH3) and nitrates (NO3-) by nitrogen-fixing bacteria in the soil. These nitrates are then taken up by plants and used to build proteins and other essential molecules. Animals then consume these plants and incorporate the nitrogen into their own tissues.\n\nWhen plants and animals die, decomposers break down their organic matter and release ammonia and nitrates back into the soil. This process is known as ammonification. Other bacteria then convert the ammonia back into nitrogen gas through a process called denitrification, completing the nitrogen cycle.\n\nA schematic diagram of the nitrogen cycle is shown below:\n\nAtmospheric nitrogen is converted into usable forms by nitrogen-fixing bacteria in the soil, which are then taken up by plants and consumed by animals",
    "pages": [
      89,
      87,
      346,
      47
    ]
  },
  "6. What is ecological succession, Discuss the principle of ecological succession with a suitable diagram?": {
    "answer": "\nEcological succession is a process through which ecosystems tend to change over a period of time. It is the process of gradual change in the species composition of a community over time. Succession can be related to seasonal environmental changes, which create changes in the community of plants and animals living in the ecosystem. Other successional events may take much longer periods of time extending to several decades.\n\nThe principle of ecological succession is based on the idea that every ecosystem has the potential to develop into a stable, mature community over time. This process is driven by the changes in the physical and biological factors within the ecosystem. The principle of ecological succession can be illustrated with the help of a suitable diagram:\n\n[Insert diagram of ecological succession here]\n\nThe diagram shows the different stages of ecological succession in a forest ecosystem. The pioneer stage is characterized by the colonization of the area by small plants and animals, such as lichens and mosses. These organisms are able to survive in harsh conditions and gradually change the physical environment, making it more suitable for other species to colonize.\n\nAs the ecosystem progresses, the community moves towards a series of changes known as seral stages. These stages are characterized by the presence of different species and a gradual increase in species diversity. The climax stage is the final stage",
    "pages": [
      5,
      89,
      358,
      81
    ]
  },
  "7. What is biodiversity, Discuss various types of biodiversity": {
    "answer": "\nBiodiversity is the degree of nature's variety in the biosphere. It refers to the variety of living organisms, their genetic diversity, and the variety of ecosystems in which they live. Biodiversity can be observed at three levels: genetic variability within a species, the variety of species within a community, and the organization of species in an area into distinctive plant and animal communities, known as ecosystem diversity.\n\n1. Genetic Diversity:\nGenetic diversity refers to the differences in genes among individuals of a species. This diversity is essential for the health and survival of a species. It allows for adaptation to changing environmental conditions and helps maintain a diverse gene pool. Loss of genetic diversity can lead to inbreeding and eventually, extinction of a species.\n\n2. Species Diversity:\nSpecies diversity is the number and variety of species present in a particular region or ecosystem. It includes both wild and domesticated species. Some areas are more rich in species than others, and the diversity of species is essential for maintaining a healthy ecosystem. Loss of species diversity can have a cascading effect on the entire ecosystem.\n\n3. Ecosystem Diversity:\nEcosystem diversity refers to the variety of habitats, communities, and ecological processes in an area. It includes different types of forests, grasslands, wetlands",
    "pages": [
      109,
      108,
      111,
      117
    ]
  },
  "8. What do you understand by hot spot biodiversity? Briefly discuss the hot spot biodiversity of India.": {
    "answer": "\nHot spot biodiversity refers to areas with high levels of biodiversity, meaning they contain a large number of species, many of which are endemic (found only in that area). These areas are considered to be the richest, rarest, and most distinctive natural areas in the world.\n\nIndia is considered a mega diversity nation, with a high level of biodiversity. The country has several hot spots of biodiversity, including the forests of the North-East and the Western Ghats, which are included in the world’s most bio-rich areas. The Andaman and Nicobar Islands are also extremely rich in species, with many subspecies of different animals and birds having evolved there. The Andaman and Nicobar Islands alone have over 2200 species of flowering plants and 120 species of ferns.\n\nOther hot spots of biodiversity in India include the high rainfall areas of the Western Ghats, Eastern Ghats, Northern Himalayas, and the North-Eastern hills. The North-Eastern states have 1,500 endemic plant species, and a major proportion of amphibian and reptile species are concentrated in the Western Ghats, which is also home to 1,500 endemic plant species. Additionally, coral reefs in Indian waters, such as those surrounding the Andaman and Nicobar Islands, are",
    "pages": [
      117,
      118,
      108,
      6
    ]
  },
  "9. Justify India is a mega biodiversity nation in the world.": {
    "answer": "India is considered a mega biodiversity nation because it has a diverse range of flora and fauna, with many species found only in India and not found anywhere else in the world. It is estimated that 18% of Indian plants are endemic, meaning they are found only in India. India also ranks among the top 10 or 15 countries for its variety of plants and animals, with high species diversity of ferns, orchids, and insects. With 89 National Parks and 500 Wildlife Sanctuaries, India has a large number of protected areas that are home to rare and endangered species like the snow leopard, Hangul deer, and pygmy hog. India has also signed international agreements and conventions like the World Heritage Convention and the Convention in the Trade of Endangered Species, showing its commitment to protecting its rich biodiversity. Additionally, India's unique geographical position between three distinctive centers of biological evolution has contributed to its high levels of biodiversity. All of these factors make India a mega biodiversity nation in the world.",
    "pages": [
      116,
      118,
      117,
      132
    ]
  },
  "10. Define Insitu and Ex-Situ conservation of Biodiversity and give example from each category.": {
    "answer": "In-situ conservation refers to the preservation of biological diversity in its natural environment. This is achieved by creating protected areas such as national parks and wildlife sanctuaries to preserve intact ecosystems. For example, the Project Tiger initiative in India aims to protect the tiger species and its habitat by creating a network of national parks and wildlife sanctuaries.\n\nEx-situ conservation, on the other hand, involves the conservation of species outside of their natural habitats. This can be done through breeding programs in controlled environments such as botanical gardens or zoological parks. An example of ex-situ conservation in India is the Crocodile Breeding and Conservation Program, which has successfully bred and restocked thousands of crocodiles in natural water bodies. Another example is the gene banks that preserve the germ plasm of plant species for future use. ",
    "pages": [
      135,
      131,
      108,
      115
    ]
  },
  "11. What are the types of renewable energy sources and briefly discuss the working principle of solar and tidal energy generation.": {
    "answer": "There are three main types of energy; those classified as non-renewable; those that are said to be renewable; and nuclear energy.\n\nRenewable energy sources include wind energy, solar energy, geothermal energy, tidal energy, and wave power. These sources harness natural processes to produce electricity, without depleting finite resources.\n\nSolar energy is the conversion of sunlight into electricity using solar panels, which are placed on rooftops or open fields. The panels absorb sunlight and convert it into direct current (DC) electricity, which is then converted to alternating current (AC) electricity and used to power homes and buildings.\n\nTidal energy is generated by placing a barrage across an estuary and allowing the tidal flow to pass through turbines. This creates electricity through the movement of the tides, which is a predictable and consistent source of energy.",
    "pages": [
      74,
      71,
      65,
      73
    ]
  },
  "12. What is decibel? Write the major noise reduction technique.": {
    "answer": "The sound level is measured in decibels (dB), which is a logarithmic scale. The major noise reduction technique is to reduce noise at the source. This can be achieved by muffling vehicles and machinery, using rigid sealed enclosures around machinery, isolating machines from the floor, and using flexible couplings for interior pipelines. Regular and thorough maintenance of operating machinery is also a key method of noise reduction. ",
    "pages": [
      167,
      218,
      168,
      219
    ]
  },
  "13. What will be the sound power level combining the four sound levels of 56, 68, 71, and 48 dB.": {
    "answer": "\nThe sound power level will be 71 dB.",
    "pages": [
      167,
      218,
      166,
      217
    ]
  },
  "14. Discuss municipal solid waste management technique with a suitable schematic diagram": {
    "answer": "\nMunicipal solid waste management involves three main components: source reduction, recycling, and disposal.\n\nSource reduction is the most fundamental way to reduce waste. It can be achieved by using less material when making a product, reusing products on site, and designing products or packaging to reduce their quantity. On an individual level, we can reduce the use of unnecessary items while shopping, buy items with minimal packaging, avoid buying disposable items, and avoid asking for plastic carry bags.\n\nRecycling is reusing some components of waste that may have economic value. Recycling has readily visible benefits such as conservation of resources, reduction in energy used during manufacture, and reducing pollution levels. Some materials such as aluminum and steel can be recycled many times. Metal, paper, glass, and plastics are recyclable. However, recycling presents several problems, such as technical and economical issues. Plastics are difficult to recycle because of the different types of polymer resins used in their production. Separation of different plastics before recycling is necessary. Similarly, recycled paper has weakened fibers and is difficult to control the color of the recycled product. It is also more expensive than virgin paper.\n\nDisposal of solid waste is done most commonly through a sanitary landfill or incineration. A modern sanitary landfill is a depression in",
    "pages": [
      172,
      223,
      339,
      340
    ]
  },
  "15. Compute the landfill area requirement for 20 years for a city of population about 6 Lakh. (Assume MSW generation as 500 gm per capita per day; MSW density as 500 kg/m3; Height of dump as 15 m).": {
    "answer": "The landfill area requirement for 20 years for a city of population of 6 lakh can be computed as follows:\n\nStep 1: Calculate the total MSW generated in 20 years.\nTotal MSW generated in 20 years = (MSW generation per capita per day) x (Population) x (Number of days in 20 years)\n= (500 gm) x (6 lakh) x (365 days x 20 years)\n= 2190000000 kg\n\nStep 2: Calculate the volume of MSW.\nVolume of MSW = (Total MSW generated in 20 years) / (MSW density)\n= 2190000000 kg / 500 kg/m3\n= 4380000 m3\n\nStep 3: Calculate the base area of the landfill.\nBase area = Volume / Height of dump\n= 4380000 m3 / 15 m\n= 292000 m2\n\nStep 4: Convert the base area to hectares.\n1 hectare = 10000 m2\nTherefore, the landfill area requirement for 20 years is:\n292000 m2 = 292000/10000 = 29.2 hectares.",
    "pages": [
      172,
      223,
      340,
      339
    ]
  },
  "16. Discuss the major causes of ozone depletion with suitable chemical reaction.": {
    "answer": "Ozone depletion is caused by the release of ozone depleting substances (ODS) such as chlorofluorocarbons (CFCs) and halons into the atmosphere. These chemicals break down the ozone layer by reacting with ozone molecules, leading to the release of chlorine or bromine atoms. These atoms then react with and destroy ozone molecules, reducing the amount of ozone in the stratosphere. This process is shown by the following chemical reactions:\n\n1. CFC + UV radiation → Cl + O3 → ClO + O2\n2. ClO + O3 → Cl + 2O2\n\nThe chlorine atom is regenerated in the second reaction, allowing it to continue destroying ozone molecules. This results in a net decrease in the amount of ozone in the atmosphere.\n\nAnother important cause of ozone depletion is the emission of nitrous oxides (NOx) from fertilizers and other human activities. These compounds react with ozone in the stratosphere, leading to the formation of nitrogen oxides (NO2) and atomic oxygen (O). The atomic oxygen then reacts with and destroys ozone molecules, reducing the amount of ozone in the stratosphere.\n\nThe release of ozone depleting substances and nitrous oxides into the atmosphere is mainly",
    "pages": [
      261,
      146,
      197,
      262
    ]
  },
  "17. Define sustainable development; discuss various strategies of rainwater harvesting and watershed management.": {
    "answer": "\nSustainable development is a development strategy that aims to meet the needs of the present without compromising the ability of future generations to meet their own needs. It involves the judicious use of resources to ensure economic growth, social equity, and environmental protection.\n\nRainwater harvesting is a method of managing rainwater by collecting and storing it for later use, especially in areas with limited access to clean water. It can be done through various strategies such as rooftop collection, surface runoff collection, and recharge pits.\n\nWatershed management is a land management program that looks at a region from the perspective of all its water-related issues. It involves the management of a single unit of land with its water drainage system. Some strategies of watershed management include soil and water conservation, developing vegetative cover, and constructing nala plugs and check dams to prevent rapid runoff during monsoons. It also involves afforestation and preventing deforestation to maintain a healthy water cycle. By implementing these strategies, watershed management can lead to a year-round abundance of water, improving the quality of human life in the area. ",
    "pages": [
      247,
      246,
      239,
      245
    ]
  },
  "18. What do you mean by Green House Effect? Write the adverse effect of global warming on human health and environment.": {
    "answer": "Green House Effect is a natural process in which the Earth's atmosphere traps heat from the sun, keeping the Earth's surface warm enough to support life. However, human activities such as burning fossil fuels and deforestation have increased the amount of greenhouse gases in the atmosphere, leading to an enhanced Green House Effect and causing global warming.\n\nSome adverse effects of global warming on human health and the environment include:\n\n1. Increase in temperature: As the Earth's temperature rises, it can lead to heat waves, droughts, and severe weather events, which can have a direct impact on human health.\n\n2. Rise in sea levels: Melting of polar ice caps due to global warming can cause a rise in sea levels, leading to flooding of coastal areas and displacement of people living in these areas.\n\n3. Changes in agricultural production: Changes in climate patterns can lead to a decrease in agricultural production, affecting food security and leading to malnutrition and starvation.\n\n4. Spread of diseases: Changes in temperature and precipitation patterns can lead to the spread of diseases carried by insects and pests, such as malaria and dengue fever.\n\n5. Damage to ecosystems: Global warming can cause damage to delicate ecosystems, leading to loss of biodiversity and disruption of natural habitats.\n\n6. Increased air pollution: Warmer",
    "pages": [
      147,
      198,
      258,
      298
    ]
  },
  "19. Enlist 4 important environmental laws and their objectives.": {
    "answer": "\n1) Environment (Protection) Act, 1986 - To protect and improve the quality of the environment and prevent hazards to human beings, other living creatures, plants and property.\n2) Air (Prevention and Control of Pollution) Act, 1981 - To prevent and control air pollution and improve the quality of air.\n3) Water (Prevention and Control of Pollution) Act, 1974 - To prevent and control water pollution and maintain or restore the wholesomeness of water.\n4) Wildlife Protection Act, 1972 - To protect and conserve wildlife and their habitats, and to control and regulate trade in wildlife and their products.",
    "pages": [
      240,
      269,
      279,
      277
    ]
  },
  "20. What is EIA? Discuss the EIA approval process of a newly proposed project with a schematic diagram.": {
    "answer": "\nEIA stands for Environmental Impact Assessment. It is a process that evaluates the potential environmental impacts of a proposed project or development. It is an important tool for decision making and sustainable development.\n\nThe EIA approval process of a newly proposed project involves the following steps:\n\n1. Prospecting: This is the first stage where the project proponent identifies the potential location for the project and conducts initial surveys to determine the feasibility of the project.\n\n2. Screening: In this stage, the project proponent submits a proposal to the relevant regulatory authority (such as the State Pollution Control Board) for environmental clearance. The authority then determines whether the project requires a full EIA or a rapid EIA.\n\n3. Scoping: This is a crucial step where the project proponent prepares a detailed project report and conducts a comprehensive environmental impact assessment. The report includes the potential impacts of the project on air, water, soil, biodiversity, and social aspects. The authority then reviews the report and provides a detailed scope for the EIA study.\n\n4. Public Consultation: This is an important step where the project proponent shares the summary of the EIA report with the public and seeks their opinions and suggestions. This helps in identifying any potential concerns or issues related to the project.\n\n5. Assessment",
    "pages": [
      278,
      277,
      58,
      243
    ]
  },
  "21. Define disaster as per WHO, Explain integrated disaster management with a suitable schematic diagram": {
    "answer": "\nDisaster, as defined by the World Health Organization (WHO), is a serious disruption of the functioning of a community or society, causing widespread human, material, economic, or environmental losses that exceed the ability of the affected community or society to cope using its own resources. It is often caused by natural hazards such as floods, earthquakes, cyclones, and droughts, but can also be a result of human activities.\n\nIntegrated disaster management is a holistic approach that involves coordinated efforts by all sectors and levels of society to manage disasters before, during, and after they occur. It aims to reduce the impact of disasters on human, social, economic, and environmental systems by building resilience and promoting sustainable development. This approach recognizes that disasters cannot be prevented, but their impacts can be mitigated through proactive measures.\n\nA suitable schematic diagram for integrated disaster management is shown below:\n\n<img src=\"https://i.imgur.com/7PzRItW.png\" alt=\"Schematic diagram for integrated disaster management\">\n\nAs shown in the diagram, integrated disaster management involves four main phases: preparedness, response, recovery, and mitigation. These phases are cyclical and interconnected, emphasizing the need for continuous efforts to reduce disaster risks.\n\nThe preparedness phase involves activities such as risk assessment, early warning",
    "pages": [
      182,
      233,
      183,
      234
    ]
  },
  "22. Discuss major flood management approach in India.": {
    "answer": "\nThe major flood management approach in India includes both structural and non-structural measures. The structural measures include:\n\n1. Reservoirs: The construction of reservoirs for impounding monsoon flows to be released in a regulated manner after the peak flood flow passes.\n2. Embankments and Floodwalls: The construction of embankments and floodwalls to prevent over-bank spilling.\n3. Anti-erosion measures: Measures to improve flow conditions in the channel and prevent erosion.\n4. Improved drainage: Improving drainage systems to reduce the impact of floods.\n\nThe non-structural measures include:\n\n1. Flood Plain Management: This includes flood plain zoning and flood proofing, which involves identifying areas that are prone to floods and implementing regulations to restrict development in those areas.\n2. Disaster Preparedness: This includes measures like maintaining wetlands, flood forecasting and warning services, disaster relief, flood fighting, and public health measures.\n3. Flood Insurance: Providing insurance coverage for flood-prone areas can help to mitigate the financial losses caused by floods.\n4. Wetland Conservation: Maintaining and preserving wetlands can help to absorb excess water during floods and reduce their impact.\n\nOverall, the approach towards flood management in India is shifting towards a more proactive and mitigation-based approach",
    "pages": [
      185,
      236,
      182,
      233
    ]
  },
  "23. Define disaster as per WHO, and write various causes of floods disaster": {
    "answer": "\nDisaster as per WHO is \"a serious disruption of the functioning of a community or a society involving widespread human, material, economic or environmental losses and impacts, which exceeds the ability of the affected community or society to cope using its own resources.\" \n\nThe various causes of flood disasters include:\n\n1. Heavy Monsoon Rains: In countries like India, floods are often caused by heavy monsoon rains that result in overflowing of rivers and water bodies.\n\n2. Deforestation: Deforestation reduces the soil's ability to absorb water, leading to increased surface runoff and soil erosion, which can cause floods.\n\n3. Urbanization: The rapid growth of cities and urban areas has resulted in the replacement of natural landscapes with impervious surfaces like concrete and asphalt, which increases runoff and reduces the soil's ability to absorb water.\n\n4. Dam Failures: Dam failures can cause catastrophic floods, as seen in the case of the Banqiao Dam failure in China in 1975, which resulted in the deaths of over 170,000 people.\n\n5. Climate Change: The increasing global temperatures and changing weather patterns due to climate change have resulted in more frequent and severe floods in many parts of the world.\n\n6. Land-use Changes: Changes in land-use, such as land",
    "pages": [
      182,
      233,
      56,
      55
    ]
  },
  "24. Define and Classify cyclone. Discuss major causes and mechanism of cyclone formation": {
    "answer": "\nA cyclone is a low-pressure area that is characterized by high-speed rotating winds and intense thunderstorms. It is a natural disaster that can cause severe damage to property and life. Cyclones are classified into three types: tropical cyclones, subtropical cyclones, and extratropical cyclones.\n\nTropical Cyclone: These cyclones originate in the tropical regions, typically between 5 and 30 degrees latitude, and are accompanied by intense thunderstorms, heavy rainfall, and strong winds. They are further classified into five categories based on their wind speeds, with Category 5 being the most severe.\n\nSubtropical Cyclone: These cyclones are a combination of tropical and extratropical cyclones. They typically form in the subtropical regions, between 30 and 40 degrees latitude, and are characterized by a mixture of tropical and extratropical features.\n\nExtratropical Cyclone: These cyclones form outside of the tropics, typically between 40 and 60 degrees latitude, and are commonly known as mid-latitude or frontal cyclones. They are characterized by a cold and warm front, and their formation is often associated with the meeting of two air masses with different temperatures.\n\nThe main cause of cyclone formation is the interaction between warm and cold",
    "pages": [
      186,
      237,
      182,
      233
    ]
  },
  "25. Write the recovery and restoration activities for cyclone disaster": {
    "answer": "\nThe recovery and restoration activities for cyclone disaster include:\n\n1. Emergency evacuation: The first step after a cyclone disaster is to evacuate the affected population to a safe location. This is done with the help of early warning systems and community cyclone shelters.\n\n2. Search and rescue: Once the affected population has been evacuated, search and rescue operations are carried out to locate and rescue any individuals who may have been trapped or injured during the cyclone.\n\n3. Medical and psychiatric assistance: Medical and psychiatric assistance is provided to those who have been injured or traumatized by the cyclone. This includes providing first aid, medical treatment, and psychological counseling.\n\n4. Provision of relief: Relief materials such as food, water, clothing, and shelter are provided to the affected population. This is done with the help of government agencies, NGOs, and volunteers.\n\n5. Reconstruction and rehabilitation: After the initial trauma has subsided, efforts are made to rebuild and rehabilitate the affected areas. This includes repairing damaged infrastructure, rebuilding homes and businesses, and providing livelihood opportunities to those who have lost their source of income.\n\n6. Early warning systems: In order to mitigate the effects of future cyclones, early warning systems are set up along the coastlines to alert the population in advance.\n\n",
    "pages": [
      186,
      237,
      182,
      233
    ]
  },
  "26. Classify earthquake, Discuss the major causes of earthquake.": {
    "answer": "\nNatural disasters - Earthquake\n\nMajor causes of earthquake:\n1. Plate tectonics: The movement and collision of tectonic plates, which make up the Earth's crust, is the primary cause of earthquakes.\n2. Fault lines: Earthquakes can also be caused by the sudden movement of rocks along a fault line.\n3. Volcanic activity: Earthquakes can be triggered by volcanic activity, as the movement of magma underground can cause the Earth's surface to shift.\n4. Human activities: Human activities such as fracking, mining, and dam building can also cause earthquakes by altering the Earth's crust.\n5. Nuclear testing: Underground nuclear testing can also trigger earthquakes, as the explosions can create seismic waves that can cause the Earth's surface to shift.",
    "pages": [
      182,
      233,
      186,
      237
    ]
  },
  "27. Write the common preparedness and mitigation measures for Earthquake disaster.": {
    "answer": "\nThe common preparedness and mitigation measures for Earthquake disaster include:\n\n1. Public Awareness and Training: Training programs should be organized for officials and staff of various departments involved at the state and district level. This will enable sharing of information and methodology, and promote efficient teamwork. It is essential to assess the gaps in knowledge, skills, and attitude and design a training program accordingly.\n\n2. Institutional Mechanisms: The National Disaster Management Center (NDMC) should be strengthened or developed to undertake disaster mitigation strategies. A permanent administrative structure should be in place to monitor developmental activities across departments and provide suggestions for necessary mitigation measures. Coordination between government agencies and NGOs is crucial for effective implementation.\n\n3. Incentives and Resources for Mitigation: Stable sources of funding must be developed for all mitigation programs. This can be done by providing incentives for relocation of commercial and residential activities outside disaster-prone areas. Housing finance companies should make it mandatory for structures in such areas to follow special building specifications. Disaster-linked insurance should be explored to cover not only life but also household goods, cattle, structures, and crops.\n\n4. Landuse Planning and Regulations: Long-term disaster reduction efforts should aim at promoting appropriate land-use in disaster-prone areas. This includes separating industrial areas from residential areas,",
    "pages": [
      184,
      235,
      183,
      234
    ]
  },
  "28. Differentiate nuclear fission and fusion, and write the major reason for Chernobyl Accident": {
    "answer": "- Nuclear fission is the process of splitting an atom into two or more smaller atoms, while nuclear fusion is the process of combining two or more smaller atoms to form a larger atom.\n    - The major reason for the Chernobyl Accident was human error, specifically the operators failing to properly follow safety protocols and turning off emergency systems.",
    "pages": [
      171,
      222,
      262,
      170
    ]
  },
  "29. Explain the major strategies to control fission chain reaction in nuclear reactor, and write the major reason for Chernobyl Accident": {
    "answer": "The major strategies to control fission chain reaction in a nuclear reactor are through the use of control rods, coolant, and emergency systems. Control rods are used to absorb excess neutrons and regulate the rate of the reaction. Coolant is used to remove excess heat generated by the reaction and prevent the reactor from overheating. Emergency systems, such as automatic shutdown mechanisms, are in place to stop the reaction in case of any abnormalities or malfunctions.\n\nThe Chernobyl accident was caused by a combination of human error and design flaws in the reactor. The operators at the Chernobyl Nuclear Power Station-4 removed too many control rods and shut off the emergency warning signals, causing the reaction to escalate rapidly. This, coupled with a design flaw that caused a steam explosion, led to the explosion and subsequent release of radioactive materials. ",
    "pages": [
      170,
      221,
      171,
      222
    ]
  }
}